** Creating a Database


The PostgreSQL program you downloaded in the Introduction is a /database management system/, a software package that allows you to define, manage, and query databases. When you installed PostgreSQL, it created a /database server/---an instance of the application running on your computer---that includes a default database called postgres. The database is a collection of objects that includes tables, functions, user roles, and much more. According to the PostgreSQL documentation, the default database is “meant for use by users, utilities and third party applications” (see /[[https://www.postgresql.org/docs/current/static/app-initdb.html]]/). In the exercises in this chapter, we'll leave the default as is and instead create a new one. We'll do this to keep objects related to a particular topic or application organized together.

To create a database, you use just one line of SQL, shown in [[file:ch01.xhtml#ch01list1][Listing 1-1]]. This code, along with all the examples in this book, is available for download via the resources at /[[https://www.nostarch.com/practicalSQL/]]./

#+begin_src sql :engine postgresql :dbuser postgres  :dbpassword 1618
CREATE DATABASE analysis;
#+end_src

#+begin_src sql :engine postgresql :dbuser postgres  :dbpassword 1618
grant all privileges on database analysis to org;
#+end_src

#+RESULTS:
| GRANT |
|-------|

#+begin_src sql :engine postgresql :dbuser org  :dbpassword 1618 :database analysis
\list
#+end_src



#+begin_src sql :engine mysql :dbuser org :database grocer

#+end_src
/Listing 1-1: Creating a database named analysis/

This statement creates a database on your server named analysis using default PostgreSQL settings. Note that the code consists of two keywords---CREATE and DATABASE---followed by the name of the new database. The statement ends with a semicolon, which signals the end of the command. The semicolon ends all PostgreSQL statements and is part of the ANSI SQL standard. Sometimes you can omit the semicolon, but not always, and particularly not when running multiple statements in the admin. So, using the semicolon is a good habit to form.

*** The INSERT Statement


To insert some data into the table, you first need to erase the CREATE TABLE statement you just ran. Then, following the same steps as you did to create the database and table, copy the code in [[file:ch01.xhtml#ch01list3][Listing 1-3]] into your pgAdmin Query Tool:

#+begin_src sql :engine postgresql :dbuser org  :dbpassword 1618 :database analysis
INSERT INTO teachers (first_name, last_name, school, hire_date, salary)
VALUES ('Janet', 'Smith', 'F.D. Roosevelt HS', '2011-10-30', 36200),
       ('Lee', 'Reynolds', 'F.D. Roosevelt HS', '1993-05-22', 65000),
       ('Samuel', 'Cole', 'Myers Middle School', '2005-08-01', 43500),
       ('Samantha', 'Bush', 'Myers Middle School', '2011-10-30', 36200),
       ('Betty', 'Diaz', 'Myers Middle School', '2005-08-30', 43500),
       ('Kathleen', 'Roush', 'F.D. Roosevelt HS', '2010-10-22', 38500);
#+end_src

#+RESULTS:
| INSERT 0 6 |
|------------|
Listing 1-3: Inserting data into the teachers table/

This code block inserts names and data for six teachers. Here, the PostgreSQL syntax follows the ANSI SQL standard: after the INSERT INTO keywords is the name of the table, and in parentheses are the columns to be filled ➊. In the next row is the VALUES keyword and the data to insert into each column in each row ➋. You need to enclose the data for each row in a set of parentheses, and inside each set of parentheses, use a comma to separate each column value. The order of the values must also match the order of the columns specified after the table name. Each row of data ends with a comma, and the last row ends the entire statement with a semicolon ➌.

Notice that certain values that we're inserting are enclosed in single quotes, but some are not. This is a standard SQL requirement. Text and dates require quotes; numbers, including integers and decimals, don't require quotes. I'll highlight this requirement as it comes up in examples. Also, note the date format we're using: a four-digit year is followed by the month and date, and each part is joined by a hyphen. This is the international standard for date formats; using it will help you avoid confusion. (Why is it best to use the format YYYY-MM-DD? Check out /[[https://xkcd.com/1179/]]/ to see a great comic about it.) PostgreSQL supports many additional date formats, and I'll use several in examples.

You might be wondering about the id column, which is the first column in the table. When you created the table, your script specified that column to be the bigserial data type. So as PostgreSQL inserts each row, it automatically fills the id column with an auto-incrementing integer. I'll cover that in detail in [[file:ch03.xhtml#ch03][Chapter 3]] when I discuss data types.

Now, run the code. This time the message in the Query Tool should include the words Query returned successfully: 6 rows affected.

*** Viewing the Data

#+begin_src sql :engine postgresql :dbuser org  :dbpassword 1618 :database analysis
select * from teachers
order by hire_date desc
limit 3;
#+end_src

#+RESULTS:
| id | first_name | last_name | school              |  hire_date | salary |
|----+------------+-----------+---------------------+------------+--------|
|  1 | Janet      | Smith     | F.D. Roosevelt HS   | 2011-10-30 |  36200 |
|  4 | Samantha   | Bush      | Myers Middle School | 2011-10-30 |  36200 |
|  6 | Kathleen   | Roush     | F.D. Roosevelt HS   | 2010-10-22 |  38500 |

